# Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
path = r'C:\Users\Dan\Desktop\Career Foundry\Instacart Basket Analysis'

In [3]:
df_or_pr_co = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [4]:
df_or_pr_co . shape

(32434489, 13)

checked shape of dataset to compare it to other one. it is the same

# importing products data set

In [5]:
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

In [6]:
# checking dataset
df_prods . shape

(49672, 6)

In [7]:
# looking for matches in datasets
df_prods . head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [8]:
df_or_pr_co . head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,_merge
0,0,0,2539329,1,prior,1,2,8,NaN,196,1,0,both
1,0,0,2539329,1,prior,1,2,8,NaN,14084,2,0,both
2,0,0,2539329,1,prior,1,2,8,NaN,12427,3,0,both
3,0,0,2539329,1,prior,1,2,8,NaN,26088,4,0,both
4,0,0,2539329,1,prior,1,2,8,NaN,26405,5,0,both

In [9]:
# have tried combining the datasets using the product_id as key but it causes my laptop to stop working for up to an hour and then i have to cancel the operation. 
# I will now try and follow the help section provided...

# Dealing with memory errors

In [10]:
df_or_pr_co . columns

Index(['Unnamed: 0.1', 'Unnamed: 0', 'order_id', 'user_id', 'eval_set',
       'order_number', 'orders_day_of_week', 'order_hour_of_day',
       'days_since_last_order', 'product_id', 'add_to_cart_order', 'reordered',
       '_merge'],
      dtype='object')

In [11]:
df_or_pr_co.drop(columns = {'eval_set', 'Unnamed: 0', 'Unnamed: 0.1'}, inplace = True)

In [12]:
df_or_pr_co . columns

Index(['order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_last_order', 'product_id',
       'add_to_cart_order', 'reordered', '_merge'],
      dtype='object')

In [13]:
df_prods . columns

Index(['Unnamed: 0', 'product_id', 'product_name', 'aisle_id', 'department_id',
       'prices'],
      dtype='object')

In [14]:
df_prods.drop(columns = {'Unnamed: 0'}, inplace = True)

In [15]:
df_prods . columns

Index(['product_id', 'product_name', 'aisle_id', 'department_id', 'prices'], dtype='object')

In [16]:
df_or_pr_co . info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32434489 entries, 0 to 32434488
Data columns (total 10 columns):
 #   Column                 Dtype
---  ------                 -----
 0   order_id               int64
 1   user_id                int64
 2   order_number           int64
 3   orders_day_of_week     int64
 4   order_hour_of_day      int64
 5   days_since_last_order  float64
 6   product_id             int64
 7   add_to_cart_order      int64
 8   reordered              int64
 9   _merge                 category
dtypes: category(1), float64(1), int64(8)
memory usage: 2.4 GB

In [21]:
# Change types for orders products combined data set 

df_or_pr_co['product_id'] =df_or_pr_co['product_id'].astype('int32')
df_or_pr_co['reordered']=df_or_pr_co['reordered'].astype('int8')
df_or_pr_co['add_to_cart_order']=df_or_pr_co['add_to_cart_order'].astype('int32')
df_or_pr_co['order_id']=df_or_pr_co['order_id'].astype('int32')
df_or_pr_co['user_id'] = df_or_pr_co['user_id'].astype('int32')
df_or_pr_co['order_number']=df_or_pr_co['order_number'].astype('int8')
df_or_pr_co['orders_day_of_week']=df_or_pr_co['orders_day_of_week'].astype('int8')
df_or_pr_co['order_hour_of_day']=df_or_pr_co['order_hour_of_day'].astype('int8')
df_or_pr_co['days_since_last_order']=df_or_pr_co['days_since_last_order'].astype('float16')

In [22]:
df_or_pr_co . info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32434489 entries, 0 to 32434488
Data columns (total 10 columns):
 #   Column                 Dtype
---  ------                 -----
 0   order_id               int32
 1   user_id                int32
 2   order_number           int8
 3   orders_day_of_week     int8
 4   order_hour_of_day      int8
 5   days_since_last_order  float16
 6   product_id             int32
 7   add_to_cart_order      int32
 8   reordered              int8
 9   _merge                 category
dtypes: category(1), float16(1), int32(4), int8(4)
memory usage: 958.9 MB

In [23]:
df_prods . info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49672 entries, 0 to 49671
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49672 non-null  int32
 1   product_name   49672 non-null  object
 2   aisle_id       49672 non-null  int8
 3   department_id  49672 non-null  int8
 4   prices         49672 non-null  float16
dtypes: float16(1), int32(1), int8(2), object(1)
memory usage: 776.2+ KB

In [24]:
df_prods['aisle_id'] = df_prods['aisle_id'].astype('int8')
df_prods['department_id'] = df_prods['department_id'].astype('int8')
df_prods['prices'] = df_prods['prices'].astype('float16')
df_prods['product_id'] =df_prods['product_id'].astype('int32')

In [25]:
df_prods . info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49672 entries, 0 to 49671
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49672 non-null  int32
 1   product_name   49672 non-null  object
 2   aisle_id       49672 non-null  int8
 3   department_id  49672 non-null  int8
 4   prices         49672 non-null  float16
dtypes: float16(1), int32(1), int8(2), object(1)
memory usage: 776.2+ KB

In [26]:
df_or_pr_co . head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [27]:
df_prods . head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.800781
1,2,All-Seasons Salt,104,13,9.296875
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.500000
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.500000
4,5,Green Chile Anytime Sauce,5,13,4.300781

In [43]:
# merge didnt work, will attempt to export datasets as pickles and merge in a new notebook. - i have also now realised that half of the first notebook has been lost due to my laptop freezing/crashing multiple times during this exercise

In [28]:
# exporting datasets
df_or_pr_co.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'or_pr_co.pkl'))

In [29]:
df_prods.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'prods_reduced.pkl'))